



/*
Для запуска/создания программы на Java необходимо в коде определить в основной класс
Основной класс должен иметь точно такое же название как сам файл (за исключением расширения)
Файл с основным файлом обязательно должен быть в основной папке проета/репозитория 
(т.е относительный путь до файла с основной классом - "Название файла с основным классом + расширение файла")
*/

public class Main{ // Основной класс
public 
    static void main(String args[]){
        /*
        Данный метод является точкой входа в программу. 
        String args[] - данный аргумент необходим чтобы программа могла получить параметры которые ей передали при запуске
        Именно тут можно писать действия которые должна сделать программа 
        После каждой команды в коде нужно ставить ;
        */
    }
}

