



public class Program{
    public static void main(String[] args) {
        /* Escape - последовательности - данные штуки используются во всех языках.
        Необходимы для текста
        Escape - последовательности:
            \b - Удаление последнего выделеного символа
            \n - enter
            \t - tab
            \0 - Интерменирующий ноль. 
                Обозначает конец строки / массива символов. 

        Экранирование - выполняется через \:
            \\ - Вывести \ (экранирование \)
            \" - Вывести " (экранирование ")
            \' - Вывести ' (экранирование ')
        */
    }
}


