



public class Program{
    public static void main(String[] args) {
        /*
        Символы обозначают одну определенную букву
        Для символов характерно то что обозначаются они через ''
        */

        /*
        Виды символов:
            char - размер в 1 байт (Значения: [-128 до 127] или [0 до 255])
                Обозначение: 'нужный символ'

        */
        // char - тип данных в который помещается 1 символ
        char sim = 'i'; // Так создается переменная с символом 

        System.out.print("sim: ");
        System.out.println(sim); // вывод символа в консоль
    }
}


